In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('data_cleaning_practice.csv')

In [4]:
df

,Name,Age,Gender,Salary,Department,Experience_Years,Joining_Date,Performance_Score
0,Ali,22.0,Male,50000.0,IT,2.0,2021-05-12,3.5
1,Sara,25.0,Female,60000.0,HR,3.0,2020-03-15,4.2
2,Ahmed,NaN,Male,55000.0,IT,2.0,2022-07-01,NaN
3,Ayesha,29.0,Female,NaN,Finance,5.0,2019-01-20,4.8
4,Bilal,21.0,Male,48000.0,IT,1.0,2023-06-10,3.9
5,Fatima,24.0,NaN,62000.0,HR,4.0,2020-09-05,4.1
6,NaN,23.0,Female,58000.0,Finance,NaN,2021-11-11,3.7
7,Hassan,NaN,Male,54000.0,NaN,3.0,2022-02-02,4.0
8,Zara,26.0,Female,NaN,IT,2.0,2019-12-30,NaN
9,Usman,22.0,Male,51000.0,HR,2.0,2021-08-18,3.8
10,Ahmed,NaN,Male,55000.0,IT,2.0,2022-07-01,NaN

In [5]:
df.head()

,Name,Age,Gender,Salary,Department,Experience_Years,Joining_Date,Performance_Score
0,Ali,22.0,Male,50000.0,IT,2.0,2021-05-12,3.5
1,Sara,25.0,Female,60000.0,HR,3.0,2020-03-15,4.2
2,Ahmed,NaN,Male,55000.0,IT,2.0,2022-07-01,NaN
3,Ayesha,29.0,Female,NaN,Finance,5.0,2019-01-20,4.8
4,Bilal,21.0,Male,48000.0,IT,1.0,2023-06-10,3.9

In [6]:
df.tail()

,Name,Age,Gender,Salary,Department,Experience_Years,Joining_Date,Performance_Score
6,NaN,23.0,Female,58000.0,Finance,NaN,2021-11-11,3.7
7,Hassan,NaN,Male,54000.0,NaN,3.0,2022-02-02,4.0
8,Zara,26.0,Female,NaN,IT,2.0,2019-12-30,NaN
9,Usman,22.0,Male,51000.0,HR,2.0,2021-08-18,3.8
10,Ahmed,NaN,Male,55000.0,IT,2.0,2022-07-01,NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               10 non-null     object
 1   Age                8 non-null      float64
 2   Gender             10 non-null     object
 3   Salary             9 non-null      float64
 4   Department         10 non-null     object
 5   Experience_Years   10 non-null     float64
 6   Joining_Date       11 non-null     object
 7   Performance_Score  8 non-null      float64
dtypes: float64(4), object(4)
memory usage: 836.0+ bytes

In [8]:
df.isnull().sum()

Name                 1
Age                  3
Gender               1
Salary               2
Department           1
Experience_Years     1
Joining_Date         0
Performance_Score    3
dtype: int64